{
  "participants": [
    {
      "name": "Samantha Harmon Shuflin"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Samantha Harmon Shuflin",
      "timestamp_ms": 1405996298703,
      "content": "Thanks Andy! Good luck with your year abroad. I'm sure it will be awesome. I hope I get to see you sometime when you get back :)",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1405996161775,
      "content": "Awesome! One more semester isn't too bad. And Chicago would be pretty cool. Good luck finishing up",
      "type": "Generic"
    },
    {
      "sender_name": "Samantha Harmon Shuflin",
      "timestamp_ms": 1405995706173,
      "content": "That is really cool. I just googled the islands and you are basically going to be living on a beach for a year huh? Have fun! I still have a semester left of school and then next summer I'll be starting my internship either here at state or in Chicago.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1405995512265,
      "content": "I'm going to the Marshall Islands to teach, probably English. It's one of those teach abroad programs",
      "type": "Generic"
    },
    {
      "sender_name": "Samantha Harmon Shuflin",
      "timestamp_ms": 1405995413552,
      "content": "Wow! Yea I wish I could have seen you too. I'm glad I was able to talk to you today before you go. Where are you going & why?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1405994971711,
      "content": "I just know the bare essentials. I can't \"tag\" a \"status wall,\" or anything complex like that. I'm actually using a facebook because I'm leaving the country tomorrow, and I'm going to use this and a blog to stay connected a little bit. I wish I would have met up with you at least once this summer before I left; I'll be leaving for a year. I guess we'll just have a lot to talk about next time we run into each other. Hope you're doing well.",
      "type": "Generic"
    },
    {
      "sender_name": "Samantha Harmon Shuflin",
      "timestamp_ms": 1405947113179,
      "content": "WHAT! NO WAY! I can't believe you have a Facebook now. do you even know how to use it?! Haha :P",
      "type": "Generic"
    }
  ],
  "title": "Samantha Harmon Shuflin",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/SamanthaHarmonShuflin_KnXrRsJ-kw"
}