{
  "participants": [
    {
      "name": "Facebook User"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Facebook User",
      "timestamp_ms": 1420231004546,
      "content": "Thanks man! Ya I'm heading down on Jan 5th. So pretty soon. But, luckily I'm going to be living with Charles and the guys in the UCO house. There's like 10 of us so it's pretty cramped but thats good for rent. It was really good to hear from ya man, I've been missing ya. Sounds like you're doing well though. It was really good to hear from you. God bless!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1420228825662,
      "content": "Sorry, the internet went out. What I was about to say to you before is that I don't think anyone has translated Oh Come Oh Come Immanuel, and my church sings all their songs in Marshallese. But once I get a better grasp of the language, I will make that translation my top priority. Say hi to Ed for me, and Dan son Dan if he's around (I can't remember what year he was). But maybe you're leaving for Maryland really soon? I hope the trip down there goes alright, and I hope you don't have to pay outrageous rent, like Jason was doing for a while. I'll be praying for you.",
      "type": "Generic"
    },
    {
      "sender_name": "Facebook User",
      "timestamp_ms": 1420172574730,
      "content": "Oh and I went over to Ed's for thanksgiving and before I left for Christmas and they wanted me to let you know that they're praying for ya and all that.",
      "type": "Generic"
    },
    {
      "sender_name": "Facebook User",
      "timestamp_ms": 1420172484332,
      "content": "Oh my goodness.  How exotic! That sounds so awesome! They really start in October? That's a heck of a long advent haha did they sing oh come oh come Emmanuel ever? And I guess some parts of the world aren't ready for tommy yet. Haha give it time lol chuck Norris movies will have to do. Didn't you tell me once that you used to watch a lot of walker Texas ranger?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1420172265936,
      "content": "I remember you saying something about taking Tommy to the Marshall Islands. They might be too conservative to embrace The Room, but they do love bad movies out here. They watch anything with action, so they love Chuck Norris and these awful horror movies; it's awesome.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1420172113057,
      "content": "I'm doing great. Most of what I do out here is school stuff - not that exciting. I just finished the Marshallese Christmas season, which starts in early October. All the churches - even on the remote islands - practice for these \"beat\" performances, which involves singing and choreographed dancing. Someone on my church let me be on the team for my district. I only went to the last week of practice, and it was still exhausting. We would sometimes practice until 3am. On Christmas, the performances started around noon and went until 5am the next day. Then we performed at other churches a couple days later. I never completely know what's going on; I think our group is done performing, but I'm going to watch another group my students are in tonight, and I won't expect to get much sleep. After tonight, though, its mostly back to school stuff.",
      "type": "Generic"
    },
    {
      "sender_name": "Facebook User",
      "timestamp_ms": 1420171570047,
      "content": "I read your blog post. Climbing palm trees and all that? Sounds awesome!",
      "type": "Generic"
    },
    {
      "sender_name": "Facebook User",
      "timestamp_ms": 1420171551706,
      "content": "Bro. Andy so good to hear from ya! Thanks, I'm really pumped to be heading down there! How are you though?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1420171380191,
      "content": "So I was hoping I might be able to skype with y'all during the road trip, but I don't think I'm going to be able to get on a computer with a microphone or anything. I can probably skype with you another time (I can sometimes borrow my roomate's laptop on the weekend and pick up internet from the school. But right now, I thought I would at least congratulate you on getting into the University of Maryland. That's really cool, and I know Jason is happy to have you out on the east coast with him.",
      "type": "Generic"
    }
  ],
  "title": "Facebook User",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/FacebookUser_mtrGEhI30A"
}