{
  "participants": [
    {
      "name": "Annie Borema"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1456530216542,
      "content": "Haha oh yeah, well that's still cool. Is it scary at all or do you have a lot of outbreaks at your school?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1456400625388,
      "content": "That would be great; I could walk to that school. It's actually in Monroe",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1456369468273,
      "content": "Oh nice, I'm sure you'll have some good stories. Is that the one on textile near carpenter?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1456111345870,
      "content": "No problem. The new job is alright. I'm at an alternative high school, with expelled students and former dropouts, so it will be interesting. But so far, so good.",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1455836502671,
      "content": "Sounds good just keep me posted, sorry I can't make it this next weekend. Are you liking the new job?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1455836049102,
      "content": "It won't work for me to take next Friday off work, so maybe next weekend won't work. I don't really know what weekend will work, but I know there's a few weekends in March that work for Jason. So I'll let you know if I have another plan for a trip",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1455322888147,
      "content": "Oh nice, it looks like it's about a 10 hour drive but yeah I'd be down to go if we could leave Thursday night/Friday morning but otherwise I don't know if I'd want to make the trip if we only left Friday night gas is cheap now too so that's good",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1455322374351,
      "content": "It's just a long-term sub teacher job - nothing that different. And Jason lives in northern Virginia, which is where I was planning to go. I might want to go to Maryland too, but it's all in the DC area. I'll see if I can't maybe get that Friday off",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1455313733322,
      "content": "That's awesome, where did you get a job at? And where at in Virginia does Jason live again (or is that the same place you were planning to travel to?) I have Friday's off and occasionally I have been able to get Monday's off too though it is a bit tougher",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1455234959207,
      "content": "So, I just took a job where I might not be able to get Mondays or Fridays off. Would you want to try to pull off the Virginia trip from Friday afternoon to Sunday night? And, I'll still try to get Monday 2/29 or Friday 2/26 off (which one do you have off?)",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1454624638040,
      "content": "To switch*",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1454624627622,
      "content": "Hey! I would love to go out east, how long of a trip are you guys thinking? I actually think I have that weekend off of work which means it's a three day weekend for me though I may be able to get a little extra if I find a few other people to aw rich with me",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1454621147561,
      "content": "Hey, Annie! You still at all interested in heading out east? Me and Jason have a friend from GVSU who also wants to drive out east one of these weekends. We could maybe all go together? Jason said Feb 27 weekend would be good, and I'm off of work. But other weekends might work too. Just let me know",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1404778286275,
      "content": "Haha yeah, I feel like MI had such a bad winter that everyone decided to move to the equator for a year.  I have told Aras about you and you should definitely meet up with him when you guys get down there.  I'm sure it would be a comforting feeling having someone else there that knows MI.  If I don't talk to you before you leave then good luck!!  You all will do great!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1404751509967,
      "content": "I am really excited, although I have no idea what to expect. And that is a bizarre coincidence. I was surprised just to see that someone from Western was going; I didn't even think that there might be some connection. We'll have to try and bring some Michigan culture to the islands",
      "type": "Generic"
    },
    {
      "sender_name": "Annie Borema",
      "timestamp_ms": 1404343825847,
      "content": "Hey!  I hope all is going well!  This may be a really weird message but I just found out that you will be going to the Marshall Islands with my boyfriend.  Isn't that such a small world?  I was talking to Jason the other day and he thought it was crazy too haha.  Are you getting excited to leave??  Only a few more weeks!  It sounds like it is going to be an awesome time.  Anyway, I just thought it was crazy that I actually knew one of the 29 other people going on the trip.",
      "type": "Generic"
    }
  ],
  "title": "Annie Borema",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/AnnieBorema_biiB7bVgcQ"
}