{
  "participants": [
    {
      "name": "Veronika Kwinecki"
    },
    {
      "name": "Erin Mae"
    },
    {
      "name": "Kelsey Wouk"
    },
    {
      "name": "Aras Karaitis"
    },
    {
      "name": "Gabby Formica"
    },
    {
      "name": "JoAnn Doll"
    },
    {
      "name": "Taylor Schwab"
    },
    {
      "name": "Evan Martin"
    },
    {
      "name": "Bo Bridwell"
    },
    {
      "name": "Lance Marczak"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Erin Mae",
      "timestamp_ms": 1437813619859,
      "content": "thanks guys- does anyone else have a scheme of work?",
      "type": "Generic"
    },
    {
      "sender_name": "JoAnn Doll",
      "timestamp_ms": 1437794179391,
      "content": "I think I left a binder with all of my lesson plans and schemes of work there as well, in the storage room",
      "type": "Generic"
    },
    {
      "sender_name": "JoAnn Doll",
      "timestamp_ms": 1437794152757,
      "content": "I left about 25 copies of Call It Courage in my classroom, and there was a set of Life of Pi there as well",
      "type": "Generic"
    },
    {
      "sender_name": "JoAnn Doll",
      "timestamp_ms": 1437794107412,
      "content": "wow sorry I didn't reply",
      "type": "Generic"
    },
    {
      "sender_name": "Gabby Formica",
      "timestamp_ms": 1437793567088,
      "content": "i left 30 copies of animal farm. Gave it to the head of the english department, but the MIHS vol can ask Cherry about them (thats her name)",
      "type": "Generic"
    },
    {
      "sender_name": "Bo Bridwell",
      "timestamp_ms": 1437790156700,
      "content": "Hey I left 30 copies of Lord Of the Flies at K.A.H.S for the next volunteer to use",
      "type": "Generic"
    },
    {
      "sender_name": "Erin Mae",
      "timestamp_ms": 1436669470391,
      "content": "Hey high school gang! So as some of you may know, the next WT crew's orientation is just around the corner (they fly in thursday). I am trying to make this year's orientation more conducive and helpful for the high school volunteers, because as we all know,last year gave little guidance for you guys before you went to your placements. Veronika will actually be returning with the group and is going to be my orientation assistant and will be leading many of the teaching sessions, especially those geared towards high school placements. However, since every high school placement is a bit different in what resources and materials are available to you, I'd really appreciate it if you could write a little blurb about how things went down at your school. Also, if you have any yearly plans, schemes of work, standards, anything that you could send me that would be ideal. Im having trouble these things from the MOE (go figure) and would really appreciate it if you could send me and Veronika whatever you have. We are going to be doing a session with the high school vols about how to make yearly plans off of the HS standards that are given out at some schools. Any input that you guys can offer up would be greatly appreciated! My email for now is rmi2@worldteach.org (Lara's old email) and veronika's is veronika@buffalo.edu. Kommol tataaaaa",
      "type": "Generic"
    }
  ],
  "title": "Veronika Kwinecki, Erin Mae, Kelsey Wouk and 7 others",
  "is_still_participant": true,
  "thread_type": "RegularGroup",
  "thread_path": "inbox/VeronikaKwineckiErinMaeKelseyWoukand7others_diOIk7OVlQ"
}