{
  "participants": [
    {
      "name": "Emily Ann"
    },
    {
      "name": "Betsy Kuck"
    },
    {
      "name": "Mary Kuck"
    },
    {
      "name": "Larry Baas"
    },
    {
      "name": "Darron Jalbert"
    },
    {
      "name": "Sarah Jalbert"
    },
    {
      "name": "Sue Loesel Kuck"
    },
    {
      "name": "Ben Kuck"
    },
    {
      "name": "Austin Allen"
    },
    {
      "name": "David Kuck"
    },
    {
      "name": "Ann Baas"
    },
    {
      "name": "Jason Kuck"
    },
    {
      "name": "Andy Kuck"
    },
    {
      "name": "Christa Kuck"
    },
    {
      "name": "Laurie Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Christa Kuck",
      "timestamp_ms": 1475332869649,
      "content": "We'll miss you two!! â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f",
      "type": "Generic"
    },
    {
      "sender_name": "Emily Ann",
      "timestamp_ms": 1475330206195,
      "content": "thanks aunt laurie! love you guys too!",
      "type": "Generic"
    },
    {
      "sender_name": "Laurie Kuck",
      "timestamp_ms": 1475330144605,
      "content": "Face time sounds like a great idea, we'll miss you but it sounds like staying home will be the healthier choice for you, love from the Ypsi Kucks",
      "type": "Generic"
    },
    {
      "sender_name": "Emily Ann",
      "timestamp_ms": 1475330110056,
      "content": "i will do that!",
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1475330083113,
      "content": "You wills in our thoughts and prayers.   Giant FaceTime for sure!  Will you let Joshua and Holly know or would you like me to do it?   Take care of you sweetie!  Love you!!!",
      "type": "Generic"
    },
    {
      "sender_name": "Emily Ann",
      "timestamp_ms": 1475329864046,
      "content": "it breaks my heart to write this because i was so excited to see everyone at the wedding, but sadly, austin and i will not be able to make it to the wedding next weekend. austin has to work and doesn't have any time off, then it's the weekend before my fall break with all 26 of my kids for two weeks off of school. i've also been having a lot of health and mental health issues lately as work has been totally crazy. my anxiety and depression have been a roller coaster as i've been trying to find the best combo of medications. i recently found out that i may also now have fibromyalgia so i'm learning that i need to take care of myself before anything else. i'll be starting physical therapy again soon, too, in hopes of helping with the daily pain i have. driving is also another one of my anxiety triggers so making the trip without austin would be a huge ordeal for me. i really wish that we could both be there to celebrate the big day! since we've moved our lives have been a total mess and we're literally just taking things one day at a time. excited to see photos that get posted from the big day! again we really wish we could be there. â\u009d¤ my parents will be at the wedding so they'll send our love and can fill you in on what's been going on with our crazy lives. i would also be willing to do a giant family face-time if anyone else is interested! love you all!",
      "type": "Generic"
    },
    {
      "sender_name": "Austin Allen",
      "timestamp_ms": 1474593066623,
      "sticker": {
        "uri": "messages/stickers_used/39178562_1505197616293642_5411344281094848512_n_369239263222822.png"
      },
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1474590867306,
      "content": "Great!  Thanks.",
      "type": "Generic"
    },
    {
      "sender_name": "Mary Kuck",
      "timestamp_ms": 1474590656996,
      "content": "We'll be picking up Ben and family at the airport and will come to the Brewery later.",
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1474369862913,
      "content": "Thanks Ben!",
      "type": "Generic"
    },
    {
      "sender_name": "Ben Kuck",
      "timestamp_ms": 1474337469841,
      "content": "We arrive around 5 on Friday. We probably won't rent a car but I think my parents will pick us up",
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1474336474208,
      "sticker": {
        "uri": "messages/stickers_used/39178562_1505197616293642_5411344281094848512_n_369239263222822.png"
      },
      "type": "Generic"
    },
    {
      "sender_name": "Jason Kuck",
      "timestamp_ms": 1474336337704,
      "content": "I'll also be heading over with my parents on Friday afternoon. Can't wait!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1474335664038,
      "content": "I'll arrive sometime Friday evening. I'll come to the brewery. Sounds fun!",
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1474334106690,
      "content": "Thanks Christa!",
      "type": "Generic"
    },
    {
      "sender_name": "Christa Kuck",
      "timestamp_ms": 1474334002204,
      "content": "I fly into Detroit around 3 on Friday, and my parents and I will head over to Grand Rapids after that. So soon! ð\u009f¤\u0097",
      "type": "Generic"
    },
    {
      "sender_name": "Sarah Jalbert",
      "timestamp_ms": 1474332098449,
      "content": "We'll be getting in pretty late (like, after 11pm) so we won'r make it to the Brewery. We'll rent a car and see you all on Saturday!",
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1474325179702,
      "content": "For everyone's information, they are invited to Founder's Brewery around 8:30 to 11 pm. We have a private room upstairs that we will be having rehearsal dinner earlier in the evening. Family are invited to join us to relax and get to meet Holly's family with the goal of making Saturday night more enjoyable for everyone.",
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1474324564071,
      "content": "ó¾®\u0097",
      "type": "Generic"
    },
    {
      "sender_name": "Emily Ann",
      "timestamp_ms": 1474324542751,
      "content": "i'm planning to drive in friday sometime (depend on if i can take a half day) - austin is working on trying to get the time off. :)",
      "type": "Generic"
    },
    {
      "sender_name": "Sue Loesel Kuck",
      "timestamp_ms": 1474324471634,
      "content": "We are available to pick anyone up at the airport as needed.  Kurt and I will have 2 vehicles in Grand Rapids both with people and luggage space.  Plus Evan might be available too. Would love to get an idea of date and time (approximately) everyone will get to Grand Rapids so that we can plan family time as best we can. So excited to see everyone and so appreciative that you are all coming.  Holly, Joshua and the rest of us couldn't Imagine this day without you each in it and that you will all be coming (barring any illnesses or unforeseen circumstances) means so much to all of us. â\u009d¤ï¸\u008f",
      "type": "Generic"
    }
  ],
  "title": "Emily Ann, Betsy Kuck, Mary Kuck and 11 others",
  "is_still_participant": true,
  "thread_type": "RegularGroup",
  "thread_path": "inbox/EmilyAnnBetsyKuckMaryKuckand11others__5KexMbFcg"
}