{
  "participants": [
    {
      "name": "Dan Netherton"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Dan Netherton",
      "timestamp_ms": 1437751980625,
      "content": "Sounds good bud! We'll probably be back August 7th through the 17th, maybe even a little longer. We'll definitely have to hang out, I'd like to hear more about what you've been doing as well!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1437750904491,
      "content": "I'm doing great. And congratulations! I guess I knew that you were in PA school somewhere, but I didn't know you got married. That's awesome. I'm around for most of August (I got back from teaching overseas for a year), but I don't think I'll be around for the week of the 16th. But we can hopefully figure something out in any case. I really want to hear what you been up to. And I'd love to meet Shelby. Just let me know. Andy",
      "type": "Generic"
    },
    {
      "sender_name": "Dan Netherton",
      "timestamp_ms": 1437750300902,
      "content": "Hey Andy! Its so good to hear from you! How have you been? What have you been up to? I've been going to school at Seton Hill University in Greensburg Pennsylvania. I'm in the Physician Assistant program there and I'm in my second semester, I'll graduate in May 2017. I recently got married as well, the wedding was this past May, in between my semesters. I won't be in Michigan this weekend unfortunately, I'm almost done with my summer semester and I have finals this upcoming week so I've been pretty busy. I'll be coming back to Michigan with my wife Shelby for a at least a week this August though. Will you be around? Also my number is 810-623-2719. I'll text you right now as well.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1437749597208,
      "content": "Dan, it's Andy Kuck. Just wondering where you're living at these days. I'll be in Michigan for a while. Maybe we can hang out sometime. I'll be in GR this weekend. At any rate, text me so I have your number; I lost my old phone. My number's still the same.",
      "type": "Generic"
    }
  ],
  "title": "Dan Netherton",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/DanNetherton_Tn4zT43dIg"
}