{
  "participants": [
    {
      "name": "Kari-Anne Innes"
    },
    {
      "name": "Donna Rowland"
    },
    {
      "name": "Daniel Matern"
    },
    {
      "name": "Riley O'Neil"
    },
    {
      "name": "Edmund Castle"
    },
    {
      "name": "Katie Kirk"
    },
    {
      "name": "Dennis Murray"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "June Saavedra",
      "timestamp_ms": 1500587906099,
      "content": "June Saavedra left the group.",
      "type": "Unsubscribe",
      "users": [
        {
          "name": "June Saavedra"
        }
      ]
    },
    {
      "sender_name": "Kari-Anne Innes",
      "timestamp_ms": 1499279093753,
      "content": "See most of you at 5:30p or 6p.",
      "type": "Generic"
    },
    {
      "sender_name": "Kari-Anne Innes",
      "timestamp_ms": 1499279092347,
      "sticker": {
        "uri": "messages/stickers_used/39178562_1505197616293642_5411344281094848512_n_369239263222822.png"
      },
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1499196315040,
      "content": "I'll be there at 530",
      "type": "Generic"
    },
    {
      "sender_name": "Katie Kirk",
      "timestamp_ms": 1499194564591,
      "content": "I can be there at 5:30 as well!",
      "type": "Generic"
    },
    {
      "sender_name": "June Saavedra",
      "timestamp_ms": 1499194535195,
      "content": "Not offended. Glad to make the necessary cuts. I can be there at 5:30",
      "type": "Generic"
    },
    {
      "sender_name": "Riley O'Neil",
      "timestamp_ms": 1499193616122,
      "content": "I can be there at 6!",
      "type": "Generic"
    },
    {
      "sender_name": "Kari-Anne Innes",
      "timestamp_ms": 1499193350810,
      "content": "Hello all,\n\nJenna and I have looked at some places to cut for time, see below. Most of these are to longer monologues, references that are not essential to the play (i.e. horses), or moments that need tightened for comic timing. Please don't take any of these personally as actors (hard I know). It's just that by Act 4 the audience is getting tired and impatient for things they don't understand or bits that go on a bit too long.\n\nCould Andy, Katie, Dennis, June and Riley meet early tomorrow (Wed) at 5:30p or 6p to run some of these? Thank you for your continued patience and commitment!!!!\n\nKA\n\npg 42: Cut \"Was ever match clapped up so suddenly\" to \"No doubt but he hath got a quiet catch\" go straight to \"But now, Baptista, to your younger daughter\" (These lines were missed yesterday, so we might as well cut them) Still looking for other places to tighten Act 1.\n\npg 52: End Biondello's monologue at \"old mothy saddle and stirrups of no kindred\" closing with a  motorcycle noise. This establishes the motorcylce, but cuts most of the other horse description that doesn't pertain to our production and for which modern audiences have no context.\n\nShorten Biondello's line to \"O, mam, his lackey, a monster, a very monster in apparel, and  not like a Christian footboy or a gentleman's lackey.\"\n\nPg 63 cut \"Now I begin . . . \" to \"But what talk I of this\" This cuts the long falling off the horse monologue and references to falling in the dirt since there are no horses and costumes are not dirty.\n\npg 70: Cut Tranio's improv line\n\nShorten the lines accompanying the booth make-out bit to:\n\nHortensio: Quick proceeders, marry!\n\nTranio: O, despiteful love! Unconstant womankind!\n\nHortensio: Mistake no more: I am not Licio. Nor a musician, as I seem to be; But one that script to live in this disguise, Know, sir, that I am call'd Hortensio.\n\nTranio: Signior Hortensio, I have often heard of your entire affection to Bianca.\n\nHortensio: See how they kiss and court! Signior Lucentio, Here is my hand, and here I firmly vow never to woo her more, but do forswear her.  For me, I will be married to a wealthy widow, Ere three days pass, which hath long loved me as I have loved this proud disdainful haggard.\n\nTranio: ....\n\nPg 74 end Tranio's line with \"And in my house you shall be friendly lodged. If this be courtesy, accept of it,\" cut the rest of that line.\n\nPg 87 Cut Biondello's two monologues, again references that our audience will not get. Go from \"And what of all this?\" to \"My  master hath appointed me to go to Saint Luke's to bid the priest be ready to come against you come with your appendix.\"",
      "type": "Generic"
    }
  ],
  "title": "Kari-Anne Innes, Donna Rowland, Daniel Matern and 4 others",
  "is_still_participant": true,
  "thread_type": "RegularGroup",
  "thread_path": "inbox/KariAnneInnesDonnaRowlandDanielMaternand4others_mZhXsQbuHw"
}