{
  "participants": [
    {
      "name": "Lindsey Thatcher"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1459303403475,
      "content": "Take care",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1459303371715,
      "content": "I would love to still meet up sometime, maybe next week or something. Whenever",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1459303310595,
      "content": "I still don't know why my phone did that.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1459303212507,
      "content": "Thanks for clearing that up. Kind of ironic that the text message you sent to clear up any ambiguity turned out to literally be the most cryptic message I've ever seen.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1459303189105,
      "photos": [
        {
          "uri": "messages/inbox/LindseyThatcher_vJD5bfmYXQ/photos/12910976_1693320530927447_234862609_n_1693320530927447.jpg",
          "creation_timestamp": 1459303188
        }
      ],
      "type": "Generic",
      "ip": "2602:304:ccc0:7080:9d4:f0d:1c74:cfb"
    },
    {
      "sender_name": "Lindsey Thatcher",
      "timestamp_ms": 1459284466455,
      "content": "Hey Andy, so sorry. I realized i didn't message you after I received your text last week. This is what my text said: \"Hey, thanks so much for the dinner invite. I'm flattered. I was so wrapped up in The Gambia/Peace Corps stuff I realized I didn't talk about present day, I'm seeing someone at this time...so maybe the dinner thing wouldn't be the best idea :p I'm really sorry if I wasn't up front about that.\" Anyway, I would still like to see you again sometime if it works out. Hope you are well. :)",
      "type": "Generic"
    },
    {
      "sender_name": "Lindsey Thatcher",
      "timestamp_ms": 1457923100575,
      "content": "my phone number is 734-646-3038 if you would prefer to text as well. :) Looking forward to seeing you.",
      "type": "Generic"
    },
    {
      "sender_name": "Lindsey Thatcher",
      "timestamp_ms": 1457923076980,
      "content": "Hey Andy! Sorry for the delayed response. It would be great to catch up. I am actually living with my parents on platt and michigan ave, also in Ypsi. So it should be easy to catch up soon. Which days work best for you? I work until about 5 Monday through Friday.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1454875431155,
      "content": "Lindsey, this is Andy Kuck, from Grand Valley. Last I saw you, you were still a few months away from Peace Corps. I saw your Gambia blog for the first time a couple months ago; I thought it'd be fun to hear about your time over there, if you're not sick of talking about it. I'm living in Ypsi right now. Are you back in Michigan? If you're not too busy and you wanna meet up and chat sometime, let me know. Hope you're doing well. Andy",
      "type": "Generic"
    }
  ],
  "title": "Lindsey Thatcher",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/LindseyThatcher_vJD5bfmYXQ"
}