{
  "participants": [
    {
      "name": "Diana Jonibwij Jonathan"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542573602198,
      "content": "Haha it's a really good book",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542573308204,
      "content": "Wow thatâ\u0080\u0099s a lot of chapters. No matter how many times you read Harry Potter, itâ\u0080\u0099s not enough.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542572874416,
      "content": "Haha great! I have some friends who I think have read the Harry Potter books 10 times. I just started reading a comic book story called Tower of God. I would recommend it - you can read it online. But if you do, make sure you start at the beginning - there's over 400 chapters.",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542572476424,
      "content": "I could try. Can you believe Iâ\u0080\u0099m reading Harry Potter again. The 4th part? I still love reading",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542572421202,
      "content": "So do you still love to read?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542572403690,
      "content": "It was called the Upward Bound Program. The classes were in Arrak, but most of the students were from town. I think Handy Emil was the only one from Laura. If you are ever back in Majuro during the summer, you could be a tutor or resident assistant for Upward Bound - they pay pretty good.",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542571827107,
      "content": "Aha yeah since we only have 2 hospitals back home. Where did you teach summer school at?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542571756463,
      "content": "That's a good plan. I hope you do well in your medical assistant program - the Majuro hospital will be lucky to have you, if that's where you decide to work",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542571187308,
      "content": "Well Iâ\u0080\u0099m pretty busy with school and everything. I want to at least have a certificate or a degree before I go back home and stay there for good.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542571107971,
      "content": "I think I will go this summer to teach summer school again. Maybe I will stay longer than just the summer - I don't know. What about you?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542569326738,
      "content": "Aha wow. I wish I could go visit them all. Yes I am still living with my grandma. Are you planning to go back anytime soon?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542567330487,
      "content": "And visiting Laura was good - quite a few people have left for America. But I saw Roline and Waju and Neirose and Eugene and a bunch of other old LHS students. It was fun!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542567186394,
      "content": "That's fantastic. That would be a great job! Are you still living with your Grandma?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542249348414,
      "content": "My trade is Medical Administrative Assistant",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542249330657,
      "content": "Yes I am still in California, wanting to go back to my island ahah. Itâ\u0080\u0099s good youâ\u0080\u0099re still teaching. How are the people back home? Youâ\u0080\u0099re not teaching Biology anymore? My English has gotten so much better right now. Iâ\u0080\u0099m attending Job Corps",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542242701641,
      "content": "What about you? Are you still living in California?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1542242685886,
      "content": "Diana! Good to hear from you! I'm doing good - I'm teaching math in the state of Indiana. But this summer I was back in Laura teaching summer school.",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1542221937056,
      "content": "Hi Andy, it's been so long. How are you doing?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1469892969785,
      "content": "And if i take that SAT and fail it again, then i will take it again and again. I just have to look for someone who can help me with tutoring and stuff.",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1469885816187,
      "content": "I will take one again until my scores are great! I just have to get to know my school and the teachers in it first. I need to be prepared this time.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1469883899603,
      "content": "Those are pretty bad. I think you would do a lot better if you took it again sometime. You're a lot smarter than that score. We didn't really do that good a job of preparing in the Marshall Islands. And, you still did better than about 150,000 people",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1469880084859,
      "content": "They're pretty bad uh?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1469769711639,
      "content": "Mr. Andy... Here are my SAT test score. 330-critical reading. 400-mathematic. 380-Writing",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1468270595799,
      "content": "Cool. They don't have a BNJ church there? I gotta go somewhere in a minute, but keep me in on how you're doing, especially how you like your new school. Take care",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1468267562473,
      "content": "There are so plenty of Marshallese there",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1468267546043,
      "content": "There are some Marshallese here. And I also go to the um... Mormon Church",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1468263854558,
      "content": "That's too bad. Maybe you can find a friendly church. Black people churches are known for being really friendly. Are there many Marshallese, besides your grandma?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1468263541892,
      "content": "No! The people here are so rude! They never said hi to one another. We only get to talk to the Marshallese people because we're afraid to talk to the people around here. And our neighborhood is full of black people. But I am trying to get used to their way of life.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1468263290529,
      "content": "Yeah, you should definitely try to go to  lots of parks and lakes. California is very beautiful. Do you have nice neighbors?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1468263069206,
      "content": "Oh ahaha no... I spent a week in Hawaii and then came here. It's so different here than back home. And also we don't get to go wherever we want here. It's also boring here,unlike the fun back home. The only thing I'm excited about being here is the schools that I will go to. And also the parks and lakes we also went to.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1468262857719,
      "content": "Awesome! Keep me up on how you like it there, if you have time. Were you in Hawaii for the last month?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1468207951235,
      "content": "I'm in Sacramento!",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1464688981002,
      "content": "Surf? Ahaha no way... I might drown",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1464666788586,
      "content": "OK. Good luck in Sacramento and God bless. Have fun in Hawaii; maybe you can learn how to surf",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1464666552550,
      "content": "I don't know maybe... My grandmother is there",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1464666523125,
      "content": "I know - lots of homeless people in Hawaii. So are there other Marshallese in Sacramento? Is that where Raymee moved to?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1464666362458,
      "content": "Very!... Here in hawaii I got to see mountains and hotels and restaurants and shops and many people... even the homeless ones",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1464666304330,
      "content": "Are you excited to live in US?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1464666223308,
      "content": "Moving there!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1464666207442,
      "content": "For the summer, or are you moving there?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1464666174088,
      "content": "Just staying for a few days and then we will go to Sacramento this friday...",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1464666137255,
      "content": "Cool! What are you doing in Hawaii?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1464666094702,
      "content": "Mr.Andy I'm in Hawaii right now and it's sooooo amazing",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1460189064548,
      "content": "Ahahha okay;) Um I don't know what my score for the SAT was... I wish I did",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1460138752752,
      "content": "Diana, I've been looking at some college scholarships that maybe you could apply for. Do you know what your score was for the SAT? Have you thought about taking it again? That might help you if you do really want to go to a U.S. college. Hope you're doing well. Make sure 11a looks sharp for the WASC people when they come",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1455318347206,
      "content": "Ahahha that'll be great! Thanks",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1455278334540,
      "content": "You're welcome, Diana. That's great that you're starting your own library; I think you would be a good librarian. I hope you like the books. Enjoy. If I send more books, I'll send some picture books too.",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1455274736513,
      "content": "Ahahah Mr. Andrew did gave me the books Mr. Andy, and they're great! Thanks... I made a little library of mine as soon as I got them and some of my friends came and sign out books with me... I didn't know that being a librarian is what I also want to be in the future... Thanks again for the books Mr. Andy. I'm also trying to teach my young cousins and my younger brother how to read, but the books are too hard for them so I had to go look for children's books at the library and with someone who has children's books... Thanks a million times Mr.Andy... Thank you",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1453354420091,
      "content": "Ahahah yes! Thank you... I'll be happy to share them with anyone who wants to read:) ur the best Mr.Andyð\u009f\u0098\u0084",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1453175595474,
      "content": "Diana, I'm gonna send some books out there to Mr. Andrew. I think I'll tell him to give them to you, and then you can share them with other people. I'll try to pick good ones, but let me know if there's a certain book you want.",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1452255795165,
      "content": "Please do... Thanks Mr.Andy... Ur the greatest! Thanks for everything though...",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1452252970614,
      "content": "'ll let you know if I hear of any others that might work for you.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1452252866188,
      "content": "Oh, alright. I really thought they would want you at the interview again this year. But if you do really want to go to college in the US or maybe somewhere else, there might be other scholarships you could get. I",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1452147483512,
      "content": "Um... Actually I didn't go to the interview... Maybe next year... Thanks anyway for asking:)",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1452145774468,
      "content": "Diana, how did the UWC scholarship interview go? Have you heard back from them yet?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1449197203396,
      "content": "U got it Mr. Scientistó¾\u008d\u0087",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1449197133610,
      "content": "I will; she'll like that. And don't actually treat the scholarship like a contest; just try to have fun and get to know the other candidates. Take care. Bye!",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1449196788921,
      "content": "Ehe... Don't worry... I'll try my best not to get nervous again. Thanks again for ur help last year... U were the best teacher ever... Say hello to ur sister Crista for me... Haven't forgotten her... Bye!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1449196614432,
      "content": "Cool. Good luck if you go to the interview again. Don't let any more Co-op students get this scholarship",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1449196400700,
      "content": "Scared??! Ahahahha. I haven't heard from them yet... Maybe on Dec. 09.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1449196321461,
      "content": "Awesome! I knew it was happening about now, but I was scared to ask; you told me you would maybe apply. Have you heard back from them yet?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1449196125663,
      "content": "Ahahah I'm fine thank you. I just wanted to tell u that I applied to the UWC scholarship again... And also thanks for helping me with the one last yearó¾\u008cµ",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1449196026565,
      "content": "Yeah. Kevin Harkey was telling me some people I could maybe stay with in Springdale. How are you?",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1449195933383,
      "content": "Mr. And ur on facebook now??!!!",
      "type": "Generic"
    },
    {
      "sender_name": "Diana Jonibwij Jonathan",
      "timestamp_ms": 1434062231931,
      "content": "Thank you million timesó¾\u008cµ",
      "type": "Generic"
    }
  ],
  "title": "Diana Jonibwij Jonathan",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/DianaJonibwijJonathan_prfz16qzpA"
}