{
  "participants": [
    {
      "name": "Hope Jallah"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1490963178474,
      "content": "Thanks. You too!",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1490904940779,
      "content": "No worries, I think they just love saying your name. Enjoy the rest of your school year!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1490894826054,
      "content": "Thanks. Tell them I'm honored, but I won't be able to make it; I'll still be teaching at my school in Indiana. Maybe I'll send a card to 12a.",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1490782160147,
      "content": "The students requested you as their guest speaker for the graduation.  Just thought I'd remind you they still absolutely love you :)",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1479217371015,
      "content": "When I came back to the states, I spent a year just working to make money, and now I'm finishing up a teacher certification program. So it hasn't been a waste of time. But I could have done that stuff after staying in Laura two more years. Because even now, part of me is considering going back and putting in two more years - doing a better job of teaching, learning the language better - but that might be difficult to work out, and it would have been a lot easier to just stay. So definitely think about staying",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1479167648608,
      "content": "Really, you think going back after a year was a bad choice? I'm really trying to figure out what I  want to do next and staying is definitely an option, but who knows. What did you end up doing when you went back? I'd definitely love to hear some of your stories with them.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1479167360831,
      "content": "Haha, those meddling kids. In all seriousness, though, dating aside, if you ever do want to chat and swap stories, let me know. I really do miss Laura (coming back to the states after only one year was a bad decision) and I love hearing what's happening there. Otherwise, good luck with this next month before the break",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1479165077337,
      "content": "Haha, yes they are all interested in the oddest of things. I'm sure they'd love to hear more Pluto stories. Lol.  They totally enjoyed talking to you,  I should have realized it was a plot to get us to talk though, can't blame them for their crazy plots they gotta make their own form of entertainment somehow. Thanks for making the time to chat with them! I'll expect that date at some point, haha jk ;)",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1479164894147,
      "content": "I guess I didn't see that message; glad it worked out anyway. It was fun to see everyone. But I didn't realize everyone was so interested in my Pluto stories. If we do something like that again, I'll have to tell them about my most recent trip to Pluto.",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1479154471048,
      "content": "I'm not sure the school wifi will allow me to connect to Skype, but I'm hoping if i leave everything up and you call, It'll connect video chat with Fb since my skype is through fb, if not maybe we could try a different time. Sorry, technology is tough.",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1479154370050,
      "content": "Hey, I'll have my computer up during 1st period today. If your still able and willing to talk to the abnormal children today just give us a call. thanks!",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1479089391814,
      "photos": [
        {
          "uri": "messages/inbox/HopeJallah_6s5GCmQAPA/photos/15049807_10211057474775783_12917478_n_10211057474775783.jpg",
          "creation_timestamp": 1479089390
        }
      ],
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1479089387392,
      "content": "Nadia says hi .... :)",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1479044567888,
      "content": "Cool. My skype name is Andrew Kuck. I think there's a picture, but let me know if you can't find me.",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1479014496374,
      "content": "Let's aim for Tuesday. And I'll look for you on Skype tomorrow",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1478995276439,
      "content": "Sorry - never responded to that question. Tomorrow or Tuesday would work. If you're going to want to do the skype thing tomorrow, let me know pretty soon; I might not be checking my facebook that often. If its Tuesday or some other day, just try to let me know like a day ahead and it will probably work.",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1478549049223,
      "content": "I think they'd like to video chat with you, lik Skype or something. I'd be willing to let them take first period to talk wirh you so it's more convenient for you and so I can hold it over their heads as a reward lol.  Maybe Monday or Tuesday of next week?",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1478526283113,
      "content": "Yeah, that would be fun. Do you mean chat like this, or a video call or skype or something? If it has to be at 8am your time, then I think your Monday would be the only day that works. If it can be 830am, then I can probably make any day work, especially your Tuesday or Thursday. Just let me know",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1478486897305,
      "content": "Hey, the kiddos are dying to talk to you, I agreed to let them chat with you during homeroom if they behave and you are willing and available to do so. And of course if there's WiFi. Hope all is well!",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474833840943,
      "content": "Written by Herma, gotta love these kids man.",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474833811839,
      "photos": [
        {
          "uri": "messages/inbox/HopeJallah_6s5GCmQAPA/photos/14458962_10210571740712735_256841335_n_10210571740712735.jpg",
          "creation_timestamp": 1474833810
        }
      ],
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474833795357,
      "content": "P.s. I found part two of our happily ever after story on my desk this morning. ....",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474833759070,
      "content": "I don't know how anyone could not be in love with Laura, Its amazing and the students just fill it with all the more joy. Thanks for the support, though I'm not teaching science my roommate is and she said she would love the extra resources if your willing to send them. My emails hope.m.conroy@gmail.com.  I'll try to provide as many stories as possible there are always plenty to tell. Your students vividly tell your alien stories often. Way to make an impact, that's the best part of teaching in my opinion. Hope all is well for you and that you have a great week!",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1474731099872,
      "content": "Lol. That doesn't surprise me. I remember Nadia answering a biology question and she found a way to fit in a paragraph about who my future kids would be. I hope you're liking it there. It seemed like the volunteers last year had a rough time. But me and my old Laura roommate really miss Laura. If you ever have questions or stories you wanna share, message me or send an email (andrew.kuck@valpo.edu) - I love hearing from Laura. And I have some teaching stuff I could email, but its for biology and earth science, which it sounds like you're not teaching.",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474676621528,
      "content": "Glad to be your fb friend and that someone has a real idea when I talk about these Abnormals. Lol",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474676579568,
      "photos": [
        {
          "uri": "messages/inbox/HopeJallah_6s5GCmQAPA/photos/14463900_10210555046815398_1498173708_n_10210555046815398.jpg",
          "creation_timestamp": 1474676578
        }
      ],
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474676550553,
      "content": "Hah! The famous Andy Kuck these Abnormals keep yammering on about. If you haven't heard the Abnormals are trying to pay match maker with their sophomore teacher and senior teacher, though I'm sure you've heard by now lol. Nadia wrote the most hilarious story about it as an assignment and this is currently written on my board by the one and only.....",
      "type": "Generic"
    },
    {
      "sender_name": "Hope Jallah",
      "timestamp_ms": 1474676282210,
      "content": "You are now connected on Messenger.",
      "type": "Generic"
    }
  ],
  "title": "Hope Jallah",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/HopeJallah_6s5GCmQAPA"
}