{
  "participants": [
    {
      "name": "Bobby Latona"
    },
    {
      "name": "Andy Kuck"
    }
  ],
  "messages": [
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1527550037855,
      "content": "Thanks!",
      "type": "Generic"
    },
    {
      "sender_name": "Bobby Latona",
      "timestamp_ms": 1527523320649,
      "content": "Congrats sounds like  a great gig! enjoy the islands.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1527522897034,
      "content": "Haha yeah, those were simple times. I got the gig just by emailing lots of people at College of the Marshall Islands. Most of the emails didn't even work, but one person told me about Upward Bound. And yeah, Todd is still out there - he's working for some other non-profit.",
      "type": "Generic"
    },
    {
      "sender_name": "Bobby Latona",
      "timestamp_ms": 1527521150478,
      "content": "Thank you, her name is Lorelei (after my mom). Upward Bound? I love that program I was a resident mentor and teacher for years in California at my University. How did you find that gig? I did not even know they had that in the Marshall Islands. Todd is still out there he said he was gonna leave years ago. That sounds like a great job congrats, enjoy the good life in the islands, I miss those simple times.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1527260241223,
      "content": "Congrats on the baby girl! What's her name? And the job isn't WorldTeach, although Todd is still on the island, so I'll try to hang out with him. It's a job with Upward Bound, teaching high schoolers marine biology in Arrak, right next to Laura. And yeah, I'll pass on the word to Grandy's family that you miss them",
      "type": "Generic"
    },
    {
      "sender_name": "Bobby Latona",
      "timestamp_ms": 1527210307720,
      "content": "Hey Andy things have been great, my baby girl is 2 months today. Thats great I am glad your heading to Majuro, what is the teaching gig? Is it WorldTeach? Sounds fun. Yeah they are great to live with. They are such a wonderful family and fun to be around. You will probably eat a lot of hot dogs and rice but it the Marshall Islands and it is to be expected. But Grandy did my laundry and always had a meal for me, they treated me like family. Let them know that I miss them and I hope everything is well.",
      "type": "Generic"
    },
    {
      "sender_name": "Andy Kuck",
      "timestamp_ms": 1526959125048,
      "content": "Bobby, how's it going? How's the family? I'm going back to Majuro this summer for a summer teaching job, and I'm planning to stay with Grandy and Jela. Do you have any warnings about staying with them? It seemed like they would be the best people to stay with. I can check to see if Jela's been doing his push-ups and pull-ups.",
      "type": "Generic"
    }
  ],
  "title": "Bobby Latona",
  "is_still_participant": true,
  "thread_type": "Regular",
  "thread_path": "inbox/BobbyLatona_u5Nw6fAm0g"
}